{
  "category": "Spanish",
  "name": "Roasted Corn and Poblano Chowder",
  "link": "https://goodcookbecky.wordpress.com/2017/10/10/roasted-corn-and-poblano-chowder/",
  "intro": "Well, my blog has been seriously neglected lately.  I have quite a few recipes that I wanted to blog, but homeschooling has kept me quite busy.  Here is a recent recipe though, that I really wanted to get on my page.  As we move from Summer to Fall, I always enjoy getting soups into my menu planning more frequently.",
  "ingredients": [
    "3 poblano peppers, stemmed, halved from stem to tip, seeds removed",
    "1 Tbsp vegetable oil",
    "6 ears fresh corn, kernels cut from cobs",
    "salt and pepper to taste",
    "4 slices bacon, chopped fine",
    "1 onion, chopped",
    "2 cloves garlic, minced",
    "7 cups chicken broth",
    "1 lb Yukon potatoes, peeled and diced into 1/2 inch dice",
    "1/4 cup half and half",
    "2 (6 inch) corn tortillas, cut into 1″ pieces",
    "1 Tbsp minced cilantro",
    "1 Tbsp lime juice",
    "additionally:",
    "lime wedges",
    "reserved bacon bits",
    "sour cream for serving, optional",
    "fried tortilla strips",
    "crumbled queso fresco"
  ],
  "instructions": [
    "Adjust the oven rack about 6 inches from the broiler element in your oven.  Line a cookie sheet with foil, rub poblano peppers with oil and place skin side up on your cookie sheet.  Broil for 10 to 15 minutes until the skin of the peppers have blistered and browned, turning with tongs from time to time.  Remove the peppers to a bowl immediately and cover with plastic wrap to steam the skins for easy removal.",
    "Place the corn kernels on the same pan you used for the peppers and season with a teaspoon of salt and add 1 teaspoon of oil, stirring the corn. Broil them for 10-15 minutes, stirring from time to time and until the corn is browned and tender.",
    "Remove the skins from the poblano peppers and chop the peppers.",
    "In a large stock pot, cook the bacon over medium heat until crispy.  Remove bacon with a slotted spoon and reserve for serving.  Add onion, 1/4 teaspoon salt to the bacon drippings.  Cook the onion, stirring frequently until the onion is tender and browned.  Add garlic and cook for 30 seconds, until fragrant.  Drain any excess bacon drippings.",
    "Add chicken broth, potatoes, corn kernels, and 1/2 teaspoon salt.  Stir the soup, scraping up any browned bits from the bottom of the pot.  Bring to a boil and simmer just under a boil for 20 minutes.  Test the potatoes to see if they are done – cook longer if necessary.  Off heat, add half and half.  Scoop out about 2 cups of soup to a large measuring cup along with the 2 corn tortillas that you have cut up;  use your immersion blender to blend the soup until smooth.  (Use a blender if you do not have an immersion blender)  Return the puree to the soup and add the chopped poblano peppers to the chowder.  Bring to a slight boil.  Add minced cilantro, lime juice, 3/4 teaspoon salt if necessary.",
    "Serve with crisp bacon bits, additional cilantro, lemon wedges, sour cream and grated queso fresco if desired.",
    "To make tortilla strips, cut some remaining corn tortillas into strips and cook them in a small frying pan in small batches and in hot oil, until the tortillas are golden brown and crispy.  Remove with a slotted spoon and season with salt immediately, draining on paper towels.  Serve them with the chowder."
  ]
}