{
  "category": "Spanish",
  "name": "Churros",
  "link": "https://goodcookbecky.wordpress.com/2018/02/24/homemade-churros/",
  "intro": "Inspired by a photo of my daughter at Disneyland eating a nice big churro, I wanted to make them at home.  It could not be that hard right?",
  "ingredients": [
    "2 cups flour",
    "2 Tablespoons unsalted butter",
    "2 Tablespoons sugar",
    "1 teaspoon vanilla extract",
    "2 cups all-purpose flour",
    "2 large eggs",
    "2 quarts vegetable oil",
    "Coating:",
    "1/2 cup sugar",
    "3/4 teaspoon cinnamon"
  ],
  "instructions": [
    "Line a rimmed baking sheet with parchment paper and spray liberally with a cooking spray.",
    "In a medium pot, over medium-high heat, bring water, butter, salt, butter, and vanilla to a boil. Turn off the burner and pull the pot off heat. Add the 2 cups of flour and use a rubber spatula to combine the flour until there are no more white streaks of flour. Transfer the dough to a stand mixer and beat on low for one to two minutes.  Add the eggs one at a time, mixing until it is combined before adding the second egg.  Increase speed to medium and beat for one minute.",
    "Fill the piping bag with half of the batter and pipe 6 long logs on the  parchment lined pan, cutting the ends with kitchen scissors. Cook’s Country magazine had a step to refrigerate the dough for 15 minutes to an hour, but I think they fry up better when the dough is at room temperature.",
    "Preheat 2 inches of oil in a heavy skillet to 375 to 400 degrees Fahrenheit.",
    "Fry 3 to 6 at a time in the oil. You may need to use tongs to separate them as they fry so they don’t get stuck together.  Fry them about two to three minutes on each side before removing them to a paper towel lined plate to drain some of the fat off. Repeat with remaining churros.",
    "In a glass pie dish or large shallow bowl, combine the half cup of sugar and 3/4 teaspoon of cinnamon.  Once the fried churros are cool enough to handle toss them in the cinnamon sugar and enjoy!"
  ]
}